documents/images/graphio/bxdf/UsdPrimvarReader_vector2.dot
digraph {
  rankdir = LR;
    IMP_UsdPrimvarReader_vector2_primvar [label= "geompropvalue"];
    IMP_UsdPrimvarReader_vector2_primvar[shape = box];
    IMP_UsdPrimvarReader_vector2_primvar ->     IMP_UsdPrimvarReader_vector2_out;
    IMP_UsdPrimvarReader_vector2_out [label= "out"];
    IMP_UsdPrimvarReader_vector2_out[shape = box]; 
    IMP_UsdPrimvarReader_vector2_varnameINT [label="varname"];
    IMP_UsdPrimvarReader_vector2_varnameINT [shape = ellipse];
    IMP_UsdPrimvarReader_vector2_primvar [label="geompropvalue"];
    IMP_UsdPrimvarReader_vector2_varnameINT -> IMP_UsdPrimvarReader_vector2_primvar [label=".geomprop"];
    IMP_UsdPrimvarReader_vector2_fallbackINT [label="fallback"];
    IMP_UsdPrimvarReader_vector2_fallbackINT [shape = ellipse];
    IMP_UsdPrimvarReader_vector2_primvar [label="geompropvalue"];
    IMP_UsdPrimvarReader_vector2_fallbackINT -> IMP_UsdPrimvarReader_vector2_primvar [label=".default"];
}
